[
  "",
  "Открытый урок по геометрии на тему: \"Теорема \nПифагора\". 8-й класс \nучитель‒  Олифирова Н.Н \nТема урока: “ТЕОРЕМА ПИФАГОРА” (8 класс) \nЦель изучения: \n1. Существенно расширить круг геометрических задач, решаемых школьниками. \n2. Познакомить учащихся с основными этапами жизни и деятельности Пифагора. \n3. Осуществление межпредметной связи геометрии с алгеброй, географией, \nисторией, литературой. \nПрогнозируемый результат: \n1. Знать зависимость между сторонами прямоугольного треугольника. \n2. Уметь доказывать теорему Пифагора. \n3. Уметь применять теорему Пифагора для решения задач. \nПлан урока: \n1. Организационный момент. \n2. Сообщение о жизни Пифагора Самосского. \n3. Актуализация знаний. \n4. Работа над теоремой. \n5. Историческая справка о теореме Пифагора. \n6. Решение задач с применением теоремы. \n7. Домашнее задание. \n8. Веселая минутка. \n9. Подведение итогов урока. \nОборудование: \n1. Портрет Пифагора. \n2. Стенд с работами: легенды о Пифагоре, нравственные заповеди пифагорейцев, \nисторические задачи, пифагорова головоломка. \n3. Чертежные инструменты. \n4. Компьютер, мультимедийный проектор, экран, колонки, программа MS Office \n2003, Power Point. \nХод урока \n(Приложение 1) \nСлайд 1. Сегодня на уроке мы приступает к изучению одной из важнейших теорем \nгеометрии – теоремы Пифагора. Она является основой решения множества \nгеометрических задач и базой изучения теоретического материала в дальнейшем. \nСлайд 2. Докажем эту теорему и решим несколько задач с её применением, но \nсначала проверим домашние задачи. \nСлайд 3. Теперь послушаем рассказ о математике, именем которого она названа \n(ученик). \nПИФАГОР САМОССКИЙ (ок. 580 – ок. 500 г. до н.э.) \nО жизни Пифагора известно немного. Он родился в 580 г. до н.э. в Древней Греции на \nострове Самос, который находится в Эгейском море у берегов Малой Азии, поэтому \nего называют Пифагором Самосским. \nВ молодости Пифагор был учеником Фалеса, которому в то время шёл восьмой \nдесяток, побывал в Египте, где учился у жрецов. Говорят, что он был допущен в \nсокровенные святилища Египта, посетил халдейских мудрецов и персидских магов. \nСлайд 4. В 530 г. до н.э. Пифагор основал так называемый пифагорейский союз. \nОколо сорока лет учёный посвятил созданной им школе. \nПифагорейцы, как их позднее стали называть, занимались математикой, \nфилософией, естественными науками. \nПифагорейцами было сделано много важных открытий в арифметике и геометрии, в \nтом числе: \n1) теорема о сумме внутренних углов треугольника; \n2) построение правильных многоугольников и деление плоскости на некоторые из \nних; \n3) геометрические способы решения квадратных уравнений; \n4) деление чисел на чётные и нечётные, простые и составные; введение фигурных, \nсовершенных и дружественных чисел; \n5) доказательство того, что \n не является рациональным числом; \n6) создание математической теории музыки и учения об арифметических, \nгеометрических и гармонических пропорциях и многое другое. \nИзвестно также, что кроме духовного и нравственного развития учеников Пифагора \nзаботило их физическое развитие. Он не только сам участвовал в Олимпийских играх \nи два раза побеждал в кулачных боях, но и воспитал плеяду великих олимпийцев. \nСлайд 5. Доказательство теоремы Пифагора считалось в кругах учащихся средних \nвеков очень трудным и называлось иногда Pons Asinorum “ослиный мост” или \nelefuga – “бегство убогих”, так как некоторые “убогие” ученики, не имевшие \nсерьезной математической подготовки, бежали от геометрии. \nСлабые ученики, заучивавшие теоремы наизусть, без понимания, и прозванные \nпоэтому “ослами”, были не в состоянии преодолеть теорему Пифагора, служившую \nдля них вроде непреодолимого моста. \nПифагор сделал много важных открытий, но наибольшую славу учёному \nпринесла доказанная им теорема, которая сейчас носит его имя. \nОткройте тетради, запишите число и тему урока “Теорема Пифагора”. \nУстная работа по готовым чертежам. \nСлайд 6 – прямоугольный треугольник. \nСлайд 7 – задачи. \nСлайд 8 – равенство треугольников по двум катетам \nСлайд 9 – свойство площадей \nСлайд 10 – нахождение угла \nСлайд 11 – подготовительный квадрат к теореме \nСлайд 12 – Докажем теорему Пифагора \n“В прямоугольном треугольнике квадрат гипотенузы равен сумме \nквадратов катетов”. c2 = a2 + b2. \nНачертите треугольник АВС с прямым углом С. \nСлайд 13. \nСлайд 14 (ученик). Интересна история теоремы Пифагора. \nХотя эта теорема и связывается с именем Пифагора, она была известна задолго до \nнего. В вавилонских текстах она встречается за 1200 лет до Пифагора. По-видимому, \nон первым нашёл её доказательство. Сохранилось древнее предание, что в честь \nсвоего открытия Пифагор принёс в жертву богам быка, по другим свидетельствам – \nдаже сто быков. Но это противоречит сведениям о моральных и религиозных \nвоззрениях Пифагора. Говорят, что он “запрещал даже убивать животных, а тем \nболее ими кормиться, ибо животные имеют душу, как и мы”. В связи с этим более \nправдоподобной можно считать следующую запись: “… когда он открыл, что в \nпрямоугольном треугольнике гипотенуза имеет соответствие с катетами, он принес в \nжертву быка, сделанного из пшеничного теста”. \nСлайд 15. Предполагают, что во времена Пифагора теорема звучала по-другому: \n“Площадь квадрата, построенного на гипотенузе прямоугольного треугольника, равна \nсумме площадей квадратов, построенных на его катетах”. \nСлайд 16. Смотрите, а вот и “Пифагоровы штаны во все стороны равны”. \nТакие стишки придумывали учащиеся средних веков при изучении теоремы; рисовали \nшаржи. Вот, например, такие. \nТеорема Пифагора – одна из главных теорем геометрии, потому что с её помощью \nможно доказать много других теорем и решить множество задач. \nРешим несколько задач. \nСлайд 17. Задача № 483. Слайд 18. Задача № 483. Слайд 19. Задача № 484. \nСлайд 20. Задача № 486. Слайд 21. Задача № 487. \nСлайд 22. Домашнее задание. \nИтак, сегодня на уроке мы познакомились с одной из главных теорем геометрии \nтеоремой Пифагора и её доказательством, с некоторыми сведениями из жизни \nучёного, имя которого она носит, решили несколько простейших задач. \nЗначение теоремы Пифагора состоит в том, что из нее или с ее помощью можно \nвывести множество теорем геометрии и решить много задач. \nК следующему уроку вы должны выучить теорему Пифагора с доказательством, так \nкак мы будем учиться применять её к решению более сложных задач. \nВыучить материалы п. 54, решить задачи № 483в, 484б,г, 486б,в. \n Раздаточный материал."
]